# Reason Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectionValidationWarning..::..Reason Property
ConnectionValidationWarning Class See Also
---
Enumeration for reason of warning.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ConnectionWarning Reason { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Reason As ConnectionWarning
	Get
```

Visual C++
---
```text
public:
property ConnectionWarning Reason {
	ConnectionWarning get ();
}
```

# See Also
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace